index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>UnicoJS Documentation</title>
<!-- 2015-02-17 Tue 19:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Eloy Gomez" />
<link rel="stylesheet" type="text/css" href="css/normalize.css" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
<!--[if !IE]>-->
<meta name="viewport" content="width=device-width">
<!--<![endif]-->
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">UnicoJS Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Unico, a reactive framework</a></li>
<li><a href="#sec-2">2. Installation</a></li>
<li><a href="#sec-3">3. Controllers</a></li>
<li><a href="#sec-4">4. Directives</a>
<ul>
<li><a href="#sec-4-1">4.1. Built in directives</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. if and unless</a></li>
<li><a href="#sec-4-1-2">4.1.2. repeat</a></li>
<li><a href="#sec-4-1-3">4.1.3. click</a></li>
<li><a href="#sec-4-1-4">4.1.4. model</a></li>
<li><a href="#sec-4-1-5">4.1.5. submit</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. <span class="todo TODO">TODO</span> Create custom directives</a></li>
</ul>
</li>
<li><a href="#sec-5">5. <span class="todo TODO">TODO</span> Components</a></li>
<li><a href="#sec-6">6. Using React classes as Unico components</a></li>
<li><a href="#sec-7">7. <span class="todo TODO">TODO</span> Models</a></li>
<li><a href="#sec-8">8. <span class="todo TODO">TODO</span> Router and Single Page Applications</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Unico, a reactive framework</h2>
<div class="outline-text-2" id="text-1">
<p>
Unico is a js framework built on top of Facebook React and inspired
by Angular. It is suitable for small widget as well as full single
page applications.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
Download Unico from the release page on github: <a href="https://github.com/harlock/unicojs/releases">https://github.com/harlock/unicojs/releases</a>
You can choose one of these versions:
</p>
<ul class="org-ul">
<li>unico.core.js: Just the framework. You must download and require dependencies.
</li>
<li>unico.js: Bundle with unico and its dependencies. Development version.
</li>
<li>unico.min.js: Production ready build.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Controllers</h2>
<div class="outline-text-2" id="text-3">
<iframe width="100%" height="300" src="http://jsfiddle.net/txotin/czbjsvr2/embedded/html,js,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>

<p>
In order to use Unico as an standalone framework in your
application, you should add the tag 'controller' to the
container. Controllers are responsible of provide data to the view
and execute callbacks on user actions.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Directives</h2>
<div class="outline-text-2" id="text-4">
<p>
Directives are the bridge between react elements and your
code. Directives give you the chance to manipulate the DOM node,
add custom listeners, or change the element behavior
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Built in directives</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> if and unless</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
These directives control the visibility of the element.
</p>

<iframe width="100%" height="300" src="http://jsfiddle.net/txotin/z3qvh5wh/embedded/html,js,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>
</div>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> repeat</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
This directive let you iterate over arrays and objects.
</p>

<iframe width="100%" height="300" src="http://jsfiddle.net/txotin/8zhhomrL/embedded/html,js,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>
</div>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> click</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
This directive execute a callback on click events. After execute the callback, it check for changes and update the view.
</p>

<iframe width="100%" height="300" src="http://jsfiddle.net/txotin/z3qvh5wh/embedded/html,js,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>
</div>
</div>

<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> model</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
This directive provide 2 way data binding.
</p>

<iframe width="100%" height="500" src="http://jsfiddle.net/txotin/z9w9ms5t/embedded/html,js,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>
</div>
</div>

<div id="outline-container-sec-4-1-5" class="outline-4">
<h4 id="sec-4-1-5"><span class="section-number-4">4.1.5</span> submit</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
This directive let you interact with forms
</p>

<iframe width="100%" height="300" src="http://jsfiddle.net/txotin/nwto8xL8/embedded/html,js,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> Create custom directives</h3>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Components</h2>
<div class="outline-text-2" id="text-5">
<p>
Components let you build reusable web components with its own controller.
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Using React classes as Unico components</h2>
<div class="outline-text-2" id="text-6">
<p>
If you want to integrate native react classes you can define a new
component and set the propety reactClass of meta. The framework
will call the react class with two properties, ctx and meta.
</p>
<iframe width="100%" height="500" src="http://jsfiddle.net/txotin/pwcdz9h0/embedded/js,html,result" allowfullscreen="allowfullscreen" frameborder="0"></iframe>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Models</h2>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <span class="todo TODO">TODO</span> Router and Single Page Applications</h2>
</div>
</div>
</body>
</html>
